cf_billing/Documents/бестИзменениеСобственникаОбъектаРасчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>бестИзменениеСобственникаОбъектаРасчета</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.бестСобственникиОбъектовРасчета</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектРасчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бестОбъектыРасчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Собственник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf_billing/InformationRegisters/бестСобственникиОбъектовРасчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бестСобственникиОбъектовРасчета</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Собственник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектРасчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бестОбъектыРасчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/Documents/бестИзменениеСобственникаОбъектаРасчета/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка Тогда
		Отказ = Истина;
	КонецЕсли;
	
	Ответственный = Пользователи.ТекущийПользователь();
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Движения.бестСобственникиОбъектовРасчета.Записывать = Истина;
	
	ПроведениеПоРегистрам();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПроведениеПоРегистрам()
	РезультатЗапроса 					= ПолучитьДанныеЗапроса();
	
	бестПроведениеСерверНП.ВыполнитьДвиженияПоРезультатуЗапроса(РезультатЗапроса,		Движения.бестСобственникиОбъектовРасчета);	
КонецПроцедуры

Функция ПолучитьДанныеЗапроса()
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст = "ВЫБРАТЬ
	|	бестИзменениеСобственникаОбъектаРасчета.Ссылка КАК Регистратор,
	|	бестИзменениеСобственникаОбъектаРасчета.Дата КАК Период,
	|	бестИзменениеСобственникаОбъектаРасчета.Организация КАК Организация,
	|	бестИзменениеСобственникаОбъектаРасчета.Район КАК Район,
	|	бестИзменениеСобственникаОбъектаРасчета.ОбъектРасчета КАК ОбъектРасчета,
	|	бестИзменениеСобственникаОбъектаРасчета.Собственник КАК Собственник
	|ИЗ
	|	Документ.бестИзменениеСобственникаОбъектаРасчета КАК бестИзменениеСобственникаОбъектаРасчета
	|ГДЕ
	|	бестИзменениеСобственникаОбъектаРасчета.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	бестИзменениеСобственникаОбъектаРасчета.Ссылка,
	|	бестИзменениеСобственникаОбъектаРасчета.Дата,
	|	бестИзменениеСобственникаОбъектаРасчета.Организация,
	|	бестИзменениеСобственникаОбъектаРасчета.Район,
	|	бестИзменениеСобственникаОбъектаРасчета.ОбъектРасчета,
	|	бестИзменениеСобственникаОбъектаРасчета.Собственник";
	Результат = Запрос.Выполнить();
	Возврат Результат;
КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли
